_posts/2014-10-11-Abbreviated-journal-names-in-bibtex.html
---
title: Abbreviated journal names in bibtex
date: 2014/10/11 17:31:59
updated: 2014/10/11 17:31:59
categories: bibtex
tags:
---



<p>
Some journals require abbreviated journal names in the bibliography, and some require full names. Unfortunately, it is not possible to have both in your bibtex file. Or is it&#x2026;
</p>

<p>
It is possible to define a <a href="http://www.bibtex.org/Format/">@string</a> that is replaced in your bibtex file. If we have the definition of the @string in a separate file, we can specify its definition there, e.g. as an abbreviation, or as the full name. To make this useful, we need a simple way to add new journals, and to generate the definitions.
</p>

<p>
First, you can find accepted journal name abbreviations here: <a href="http://cassi.cas.org/search.jsp">http://cassi.cas.org/search.jsp</a> .
</p>

<p>
We are going to define a variable to hold the string definition, journal full name and an abbreviation. You can find our production version of what follows here: <a href="https://github.com/jkitchin/jmax/blob/master/jmax-bibtex.el">https://github.com/jkitchin/jmax/blob/master/jmax-bibtex.el</a>
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8b0000;">defvar</span> <span style="color: #8b008b;">jmax-bibtex-abbreviations</span>
  '((<span style="color: #228b22;">"ACAT"</span> <span style="color: #228b22;">"ACS Catalysis"</span> <span style="color: #228b22;">"ACS Catal."</span>)
    (<span style="color: #228b22;">"AM"</span> <span style="color: #228b22;">"Acta Materialia"</span> <span style="color: #228b22;">"Acta Mater."</span>)
    (<span style="color: #228b22;">"AMM"</span> <span style="color: #228b22;">"Acta Metallurgica et Materialia"</span> <span style="color: #228b22;">"Acta Metall. Mater."</span>)
    (<span style="color: #228b22;">"AMiner"</span> <span style="color: #228b22;">"American Mineralogist"</span> <span style="color: #228b22;">"Am. Mineral."</span>)
    (<span style="color: #228b22;">"AngC"</span> <span style="color: #228b22;">"Angewandte Chemie-International Edition"</span> <span style="color: #228b22;">"Angew. Chem. Int. Edit."</span>)
    (<span style="color: #228b22;">"APLM"</span> <span style="color: #228b22;">"APL Materials"</span> <span style="color: #228b22;">"APL Mat."</span>)
    (<span style="color: #228b22;">"ACBE"</span> <span style="color: #228b22;">"Applied Catalysis B: Environmental"</span> <span style="color: #228b22;">"Appl. Catal. B-Environ."</span>)
    (<span style="color: #228b22;">"APL"</span> <span style="color: #228b22;">"Applied Physics Letters"</span> <span style="color: #228b22;">"Appl. Phys. Lett."</span>)
    (<span style="color: #228b22;">"ASS"</span> <span style="color: #228b22;">"Applied Surface Science"</span> <span style="color: #228b22;">"Appl. Surf. Sci."</span>)
    (<span style="color: #228b22;">"CL"</span> <span style="color: #228b22;">"Catalysis Letters"</span> <span style="color: #228b22;">"Catal. Lett."</span>)
    (<span style="color: #228b22;">"CT"</span> <span style="color: #228b22;">"Catalysis Today"</span> <span style="color: #228b22;">"Catal. Today"</span>)
    (<span style="color: #228b22;">"CPL"</span> <span style="color: #228b22;">"Chemical Physics Letters"</span> <span style="color: #228b22;">"Chem. Phys. Lett"</span>)
    (<span style="color: #228b22;">"CR"</span> <span style="color: #228b22;">"Chemical Reviews"</span> <span style="color: #228b22;">"Chem. Rev."</span>)
    (<span style="color: #228b22;">"CSR"</span> <span style="color: #228b22;">"Chemical Society Reviews"</span> <span style="color: #228b22;">"Chem. Soc. Rev."</span>)
    (<span style="color: #228b22;">"CSR"</span> <span style="color: #228b22;">"Chemical Society Reviews"</span> <span style="color: #228b22;">"Chem. Soc. Rev."</span>)
    (<span style="color: #228b22;">"CM"</span> <span style="color: #228b22;">"Chemistry of Materials"</span> <span style="color: #228b22;">"Chem. Mater."</span>)
    (<span style="color: #228b22;">"CSA"</span> <span style="color: #228b22;">"Colloids and Surfaces, A: Physicochemical and Engineering Aspects"</span> <span style="color: #228b22;">"Colloids Surf., A"</span>)
    (<span style="color: #228b22;">"CPMS"</span> <span style="color: #228b22;">"Computational Materials Science"</span> <span style="color: #228b22;">"Comp. Mater. Sci."</span>)
    (<span style="color: #228b22;">"CPC"</span> <span style="color: #228b22;">"Computer Physics Communications"</span> <span style="color: #228b22;">"Comput. Phys. Commun."</span>)
    (<span style="color: #228b22;">"CGD"</span> <span style="color: #228b22;">"Crystal Growth \\&amp; Design"</span> <span style="color: #228b22;">"Cryst. Growth Des."</span>)
    (<span style="color: #228b22;">"CEC"</span> <span style="color: #228b22;">"CrystEngComm"</span> <span style="color: #228b22;">"CrystEngComm"</span>)
    (<span style="color: #228b22;">"ECST"</span> <span style="color: #228b22;">"ECS Transactions"</span> <span style="color: #228b22;">"ECS Trans."</span>)
    (<span style="color: #228b22;">"EES"</span> <span style="color: #228b22;">"Energy \\&amp; Environmental Science"</span> <span style="color: #228b22;">"Energy Environ. Sci."</span>)
    (<span style="color: #228b22;">"HPR"</span> <span style="color: #228b22;">"High Pressure Research"</span> <span style="color: #228b22;">"High Pressure Res."</span>)
    (<span style="color: #228b22;">"IC"</span> <span style="color: #228b22;">"Inorganic Chemistry"</span> <span style="color: #228b22;">"Inorg. Chem."</span>)
    (<span style="color: #228b22;">"IECR"</span> <span style="color: #228b22;">"Industrial \\&amp; Engineering Chemistry Research"</span> <span style="color: #228b22;">"Ind. Eng. Chem. Res."</span>)
    (<span style="color: #228b22;">"JJAP"</span> <span style="color: #228b22;">"Japanese Journal of Applied Physics"</span> <span style="color: #228b22;">"Jpn. J. Appl. Phys."</span>)
    (<span style="color: #228b22;">"JMatR"</span> <span style="color: #228b22;">"Journal of  Materials Research"</span> <span style="color: #228b22;">"J. Mater. Res."</span>)
    (<span style="color: #228b22;">"JALC"</span> <span style="color: #228b22;">"Journal of Alloys and Compounds"</span> <span style="color: #228b22;">"J. Alloy Compd."</span>)
    (<span style="color: #228b22;">"JAC"</span> <span style="color: #228b22;">"Journal of Applied Crystallography"</span> <span style="color: #228b22;">"J. Appl. Crystallogr."</span>)
    (<span style="color: #228b22;">"JAP"</span> <span style="color: #228b22;">"Journal of Applied Physics"</span> <span style="color: #228b22;">"J. Appl. Phys."</span>)
    (<span style="color: #228b22;">"JC"</span> <span style="color: #228b22;">"Journal of Catalysis"</span> <span style="color: #228b22;">"J. Catal."</span>)
    (<span style="color: #228b22;">"JCP"</span> <span style="color: #228b22;">"Journal of Chemical Physics"</span> <span style="color: #228b22;">"J. Chem. Phys."</span>)
    (<span style="color: #228b22;">"JCG"</span> <span style="color: #228b22;">"Journal of Crystal Growth"</span> <span style="color: #228b22;">"J. Crys. Growth"</span>)
    (<span style="color: #228b22;">"JMC"</span> <span style="color: #228b22;">"Journal of Materials Chemistry"</span> <span style="color: #228b22;">"J. Mater. Chem."</span>)
    (<span style="color: #228b22;">"JMC"</span> <span style="color: #228b22;">"Journal of Materials Chemistry"</span> <span style="color: #228b22;">"J. Mater. Chem."</span>)
    (<span style="color: #228b22;">"JMSL"</span> <span style="color: #228b22;">"Journal of Materials Science Letters"</span> <span style="color: #228b22;">"J. Mater. Sci. Lett."</span>)
    (<span style="color: #228b22;">"JMS"</span> <span style="color: #228b22;">"Journal of Membrane Science"</span> <span style="color: #228b22;">"J. Memb. Sci."</span>)
    (<span style="color: #228b22;">"JPE"</span> <span style="color: #228b22;">"Journal of Phase Equilibria"</span> <span style="color: #228b22;">"J. Phase Equilib."</span>)
    (<span style="color: #228b22;">"JPCS"</span> <span style="color: #228b22;">"Journal of Physics and Chemistry of Solids"</span> <span style="color: #228b22;">"J. Phys. Chem. Solids"</span>)
    (<span style="color: #228b22;">"JPCM"</span> <span style="color: #228b22;">"Journal of Physics: Condensed Matter"</span> <span style="color: #228b22;">"J. Phys.: Condens. Matter"</span>)
    (<span style="color: #228b22;">"JSSC"</span> <span style="color: #228b22;">"Journal of Solid State Chemistry"</span> <span style="color: #228b22;">"J. Solid State Chem."</span>)
    (<span style="color: #228b22;">"JACerS"</span> <span style="color: #228b22;">"Journal of the American Ceramic Society"</span> <span style="color: #228b22;">"J. Am. Ceram. Soc."</span>)
    (<span style="color: #228b22;">"JACS"</span> <span style="color: #228b22;">"Journal of the American Chemical Society"</span> <span style="color: #228b22;">"J. Am. Chem. Soc."</span>)
    (<span style="color: #228b22;">"JES"</span> <span style="color: #228b22;">"Journal of The Electrochemical Society"</span> <span style="color: #228b22;">"J. Electrochem. Soc."</span>)
    (<span style="color: #228b22;">"JES"</span> <span style="color: #228b22;">"Journal of The Electrochemical Society"</span> <span style="color: #228b22;">"J. Electrochem. Soc."</span>)
    (<span style="color: #228b22;">"JMS"</span> <span style="color: #228b22;">"Journal of Membrane Science"</span> <span style="color: #228b22;">"J. Memb. Sci."</span>)
    (<span style="color: #228b22;">"JVST"</span> <span style="color: #228b22;">"Journal of Vacuum Science \\&amp; Technology A"</span> <span style="color: #228b22;">"J. Vac. Sci. Technol. A"</span>)
    (<span style="color: #228b22;">"ML"</span> <span style="color: #228b22;">"Materials Letters"</span> <span style="color: #228b22;">"Mater. Lett."</span>)
    (<span style="color: #228b22;">"MSE-BS"</span> <span style="color: #228b22;">"Materials Science and Engineering B"</span> <span style="color: #228b22;">"Mat. Sci. Eng. B-Solid"</span>)
    (<span style="color: #228b22;">"MOLSIM"</span> <span style="color: #228b22;">"Molecular Simulation"</span> <span style="color: #228b22;">"Mol. Sim."</span>)
    (<span style="color: #228b22;">"Nature"</span> <span style="color: #228b22;">"Nature"</span> <span style="color: #228b22;">"Nature"</span>)
    (<span style="color: #228b22;">"NM"</span> <span style="color: #228b22;">"Nature Materials"</span> <span style="color: #228b22;">"Nat. Mater."</span>)
    (<span style="color: #228b22;">"PML"</span> <span style="color: #228b22;">"Philosophical Magazine Letters"</span> <span style="color: #228b22;">"Phil. Mag. Lett."</span>)
    (<span style="color: #228b22;">"PMA"</span> <span style="color: #228b22;">"Philosophical Magazine A"</span> <span style="color: #228b22;">"Phil. Mag. A"</span>)
    (<span style="color: #228b22;">"PA"</span> <span style="color: #228b22;">"Physica A: Statistical Mechanics and its Applications"</span> <span style="color: #228b22;">"Physica A"</span>)
    (<span style="color: #228b22;">"PB"</span> <span style="color: #228b22;">"Physica B-Condensed Matter"</span> <span style="color: #228b22;">"Physica B"</span>)
    (<span style="color: #228b22;">"PCCP"</span> <span style="color: #228b22;">"Physical Chemistry Chemical Physics"</span> <span style="color: #228b22;">"Phys. Chem. Chem. Phys."</span>)
    (<span style="color: #228b22;">"PSSB"</span> <span style="color: #228b22;">"physica status solidi (b)"</span> <span style="color: #228b22;">"Phys. Status Solidi B"</span>)
    (<span style="color: #228b22;">"PRA"</span> <span style="color: #228b22;">"Physical Review A"</span> <span style="color: #228b22;">"Phys. Rev. A"</span>)
    (<span style="color: #228b22;">"PRB"</span> <span style="color: #228b22;">"Physical Review B"</span> <span style="color: #228b22;">"Phys. Rev. B"</span>)
    (<span style="color: #228b22;">"PRL"</span> <span style="color: #228b22;">"Physical Review Letters"</span> <span style="color: #228b22;">"Phys. Rev. Lett."</span>)
    (<span style="color: #228b22;">"PCM"</span> <span style="color: #228b22;">"Physics and Chemistry of Minerals"</span> <span style="color: #228b22;">"Phys. Chem. Miner."</span>)
    (<span style="color: #228b22;">"PSurfSci"</span> <span style="color: #228b22;">"Progress in Surface Science"</span> <span style="color: #228b22;">"Prog. Surf. Sci."</span>)
    (<span style="color: #228b22;">"Science"</span> <span style="color: #228b22;">"Science"</span> <span style="color: #228b22;">"Science"</span>)
    (<span style="color: #228b22;">"SABC"</span> <span style="color: #228b22;">"Sensors and Actuators B: Chemical"</span> <span style="color: #228b22;">"Sensor. Actuat. B-Chem."</span>)
    (<span style="color: #228b22;">"SS"</span> <span style="color: #228b22;">"Surface Science"</span> <span style="color: #228b22;">"Surf. Sci."</span>)
    (<span style="color: #228b22;">"EPJB"</span> <span style="color: #228b22;">"The European Physical Journal B"</span> <span style="color: #228b22;">"Eur. Phys. J. B"</span>)
    (<span style="color: #228b22;">"JPC"</span> <span style="color: #228b22;">"The Journal of Physical Chemistry"</span> <span style="color: #228b22;">"J. Phys. Chem."</span>)
    (<span style="color: #228b22;">"JPCB"</span> <span style="color: #228b22;">"The Journal of Physical Chemistry  B"</span> <span style="color: #228b22;">"J. Phys. Chem. B"</span>)
    (<span style="color: #228b22;">"JPCC"</span> <span style="color: #228b22;">"The Journal of Physical Chemistry C"</span> <span style="color: #228b22;">"J. Phys. Chem. C"</span>)
    (<span style="color: #228b22;">"JCP"</span> <span style="color: #228b22;">"The Journal of Chemical Physics"</span> <span style="color: #228b22;">"J. Chem. Phys."</span>)
    (<span style="color: #228b22;">"TSF"</span> <span style="color: #228b22;">"Thin Solid Films"</span> <span style="color: #228b22;">"Thin Solid Films"</span>)
    (<span style="color: #228b22;">"TC"</span> <span style="color: #228b22;">"Topics in Catalysis"</span> <span style="color: #228b22;">"Top. Catal."</span>)
    (<span style="color: #228b22;">"WR"</span> <span style="color: #228b22;">"Water Research"</span> <span style="color: #228b22;">"Water Res."</span>))
  <span style="color: #228b22;">"List of (string journal-full-name journal-abbreviation)"</span>)
</pre>
</div>

<pre class="example">
bibtex-abbreviations
</pre>

<p>
This data structure will serve a few purposes.
</p>

<ol class="org-ol">
<li>We will generate the bib files that define the @string definitions
</li>
<li>We will use it to modify bibtex files to use those strings.
</li>
</ol>

<p>
First, here are some simple functions to generate the @string definitions.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8b0000;">defun</span> <span style="color: #8b2323;">jmax-bibtex-generate-longtitles</span> ()
  (interactive)
  (<span style="color: #8b0000;">with-temp-file</span> <span style="color: #228b22;">"longtitles.bib"</span>
    (<span style="color: #8b0000;">dolist</span> (row bibtex-abbreviations)
      (insert (format <span style="color: #228b22;">"@string{%s=\"%s\"}\n"</span>
                      (nth 0 row)
                      (nth 1 row))))))

(<span style="color: #8b0000;">defun</span> <span style="color: #8b2323;">jmax-bibtex-generate-shorttitles</span> ()
  (interactive)
  (<span style="color: #8b0000;">with-temp-file</span> <span style="color: #228b22;">"shorttitles.bib"</span>
    (<span style="color: #8b0000;">dolist</span> (row bibtex-abbreviations)
      (insert (format <span style="color: #228b22;">"@string{%s=\"%s\"}\n"</span>
                      (nth 0 row)
                      (nth 2 row))))))
</pre>
</div>

<pre class="example">
jmax-bibtex-generate-shorttitles
</pre>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(jmax-bibtex-generate-longtitles)
(jmax-bibtex-generate-shorttitles)
</pre>
</div>

<p>
Here are the results of running that code: <a href="/media/2014-10-11-Abbreviated-journal-names-in-bibtex/shorttitles.bib">shorttitles.bib</a> and <a href="/media/2014-10-11-Abbreviated-journal-names-in-bibtex/longtitles.bib">longtitles.bib</a> . This is the first step. We have the @strings defined. Now, we need to convert the names in a bibtex entry to use our string. We want to replace full names and abbreviated names with the @string.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8b0000;">defun</span> <span style="color: #8b2323;">jmax-stringify-journal-name</span> (<span style="color: #4682b4;">&amp;optional</span> key start end)
  <span style="color: #228b22;">"replace journal name with a string. The strings are defined in `</span><span style="color: #cd0000;">bibtex-abbreviations</span><span style="color: #228b22;">'."</span>
  (interactive)
  (bibtex-beginning-of-entry)
  (<span style="color: #8b0000;">when</span>
      (string= <span style="color: #228b22;">"article"</span>
               (downcase
                (cdr (assoc <span style="color: #228b22;">"=type="</span> (bibtex-parse-entry)))))
    (<span style="color: #8b0000;">let*</span> ((full-names (mapcar
                        (<span style="color: #8b0000;">lambda</span> (row)
                          (cons  (nth 1 row) (nth 0 row)))
                        bibtex-abbreviations))
           (abbrev-names (mapcar
                          (<span style="color: #8b0000;">lambda</span> (row)
                            (cons  (nth 2 row) (nth 0 row)))
                          bibtex-abbreviations))
           (journal (s-trim (bibtex-autokey-get-field <span style="color: #228b22;">"journal"</span>)))
           (bstring (or
                     (cdr (assoc journal full-names))
                     (cdr (assoc journal abbrev-names)))))
      (<span style="color: #8b0000;">when</span> bstring
        (bibtex-set-field <span style="color: #228b22;">"journal"</span> bstring t)
        (bibtex-fill-entry)))))
</pre>
</div>

<pre class="example">
jmax-stringify-journal-name
</pre>

<p>
Now, with a single command, we can convert this:
</p>

<div class="org-src-container">

<pre class="src src-bibtex"><span style="color: #8b2323;">@article</span>{<span style="color: #cd0000;">lizzit-2001-surfac-ru</span>,
  <span style="color: #8b008b;">author</span> =       {S. Lizzit and A. Baraldi and A. Groso and K. Reuter
                  and M. Ganduglia-Pirovano and C. Stampfl and
                  M. Scheffler and M. Stichler and C. Keller and
                  W. Wurth and D. Menzel},
  <span style="color: #8b008b;">title</span> =        {Surface Core-level Shifts of Clean and
                  Oxygen-covered {R}u(0001)},
  <span style="color: #8b008b;">journal</span> =      {Physical Review B,
  <span style="color: #8b008b;">volume</span> =       63,
  <span style="color: #8b008b;">number</span> =       20,
  <span style="color: #8b008b;">pages</span> =        {nil},
  <span style="color: #8b008b;">year</span> =         2001,
  <span style="color: #8b008b;">doi</span> =          {<span style="color: #3a5fcd; text-decoration: underline;">10.1103/physrevb.63.205419</span>},
  <span style="color: #8b008b;">url</span> =          {<span style="color: #3a5fcd; text-decoration: underline;">https://doi.org/10.1103/PhysRevB.63.205419</span>},
  <span style="color: #8b008b;">month</span> =        5,
}
</pre>
</div>

<p>
into this:
</p>

<div class="org-src-container">

<pre class="src src-bibtex"><span style="color: #8b2323;">@article</span>{<span style="color: #cd0000;">lizzit-2001-surfac-ru</span>,
  <span style="color: #8b008b;">author</span> =       {S. Lizzit and A. Baraldi and A. Groso and K. Reuter
                  and M. Ganduglia-Pirovano and C. Stampfl and
                  M. Scheffler and M. Stichler and C. Keller and
                  W. Wurth and D. Menzel},
  <span style="color: #8b008b;">title</span> =        {Surface Core-level Shifts of Clean and
                  Oxygen-covered {R}u(0001)},
  <span style="color: #8b008b;">journal</span> =      PRB,
  <span style="color: #8b008b;">volume</span> =       63,
  <span style="color: #8b008b;">number</span> =       20,
  <span style="color: #8b008b;">pages</span> =        {nil},
  <span style="color: #8b008b;">year</span> =         2001,
  <span style="color: #8b008b;">doi</span> =          {<span style="color: #3a5fcd; text-decoration: underline;">10.1103/physrevb.63.205419</span>},
  <span style="color: #8b008b;">url</span> =          {<span style="color: #3a5fcd; text-decoration: underline;">https://doi.org/10.1103/PhysRevB.63.205419</span>},
  <span style="color: #8b008b;">month</span> =        5,
}
</pre>
</div>

<p>
If you have a lot of entries you want to modify, you can use bibtex-map-entries like this. Basically, put the elisp form in a comment, and then execute the elisp form
</p>

<div class="org-src-container">

<pre class="src src-bibtex"><span style="color: #ff0000; font-weight: bold;">%% (bibtex-map-entries 'jmax-stringify-journal-name)  &lt;- put cursor here. C-x C-e</span>
</pre>
</div>

<p>
This saves some effort. Over time, I will keep adding entries to the abbreviation table. As long as a standard journal name or abbreviation is in your bibtex file, this approach should work pretty well. After you replace the journal names with @string entries, you have to generate the string file, either shorttitles.bib or longtitles.bib, and in your LaTeX file, change your bibliography line to:
</p>

<div class="org-src-container">

<pre class="src src-latex"><span style="color: #8b0000;">\bibliography</span>{<span style="color: #cd0000;">shorttitles,references</span>}
</pre>
</div>

<p>
The order is important. The @string definitions are in shorttitles.bib, and your bibtex entries in references.bib.</p>
<p>Copyright (C) 2014 by John Kitchin. See the <a href="/copying.html">License</a> for information about copying.<p><p><a href="/org/2014/10/11/Abbreviated-journal-names-in-bibtex.org">org-mode source</a><p><p>Org-mode version = 8.2.7c</p>
